app/Views/partials/topbar.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '2'
---
                    <img class="rounded-circle header-profile-user" src="<?= base_url() ?>/assets/images/users/avatar-1.jpg" alt="Header Avatar">
                    <?php
                    $userModel = new UserModel();
                    $user = $userModel->find(user_id());