app/Controllers/Admin.php

  public function index()
  {
    // Request Sent
    $request_sent = [];
    $total_request_sent = 0;
    $total_request_sent_last_week = 0;
    $container = '';
    for ($i = 7; $i >= 1; $i--) {
      $builder = $this->db->table('transactions');
      $where = "DATE(created_at) = DATE(NOW() - INTERVAL " . $i . " DAY) AND id_hospital_req = " . user()->id_hospital . "";
      $builder->where($where);
      $result = $builder->countAllResults();
      $total_request_sent += $result;

      if ($i == 7) {
        $container .= $result;
      } else {
        $container .= ' ,' . $result;
      }
    }
    array_push($request_sent, $container);

    // Request sent last week
    for ($i = 14; $i >= 7; $i--) {
      $builder = $this->db->table('transactions');
      $where = "DATE(created_at) = DATE(NOW() - INTERVAL " . $i . " DAY)";
      $builder->where($where);
      $result = $builder->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE DATE(created_at) = DATE(NOW() - INTERVAL 14 DAY)

  public function show_hospital()
  {
    $id_hospital = $this->request->getVar('id_hospital');
    $name = $this->request->getVar('name');

    if (!$id_hospital && !$name) {
      $hospitals = $this->hospitalModel->findAll(50);
    } else {
      $builder = $this->db->table('hospitals');
      $builder->like('id_hospital', $id_hospital);
      $builder->like('name', $name);
      $builder->limit(50);
      $hospitals = $builder->get()->getResult();
---
SELECT *
FROM `hospitals`
WHERE `hospitals`.`deleted_at` IS NULL
 LIMIT 50
SELECT *
FROM `hospitals`
WHERE `id_hospital` LIKE '%%' ESCAPE '!'
AND  `name` LIKE '%ar bunda%' ESCAPE '!'
 LIMIT 50

  public function show_users()
  {
    // Get all user
    $builder = $this->db->table('users');
    $builder->select('users.*, auth_groups.id as group_id, auth_groups.description');
    $builder->join('auth_groups_users', 'users.id = auth_groups_users.user_id');
    $builder->join('auth_groups', 'auth_groups_users.group_id = auth_groups.id');
    $builder->where('users.deleted_at', null);
    $users = $builder->get()->getResultArray();
---
SELECT `users`.*, `auth_groups`.`id` as `group_id`, `auth_groups`.`description`
FROM `users`
JOIN `auth_groups_users` ON `users`.`id` = `auth_groups_users`.`user_id`
JOIN `auth_groups` ON `auth_groups_users`.`group_id` = `auth_groups`.`id`

  public function show_add_user()
  {
    // Get all role
    $builder = $this->db->table('auth_groups');
    $groups = $builder->get()->getResultArray();
---
SELECT *
FROM `auth_groups`

      'scope'             => 'app',
    ];

    if (!$this->userModel->save($data)) {
---
INSERT INTO `users` (`email`, `username`, `firstname`, `lastname`, `user_image`, `password_hash`, `active`, `set_up`, `scope`, `created_at`, `updated_at`) VALUES ('ali@mail.com', 'ali', 'RS', 'ALI', 'default.svg', '$2y$10$yNRCE3VKfLKMgXcjcsrGruVfOLnehoox0IfqNjkv3yVTq6RFkGW2a', 1, 0, 'app', '2022-09-25 15:51:40', '2022-09-25 15:51:40')

    ];

    $builder = $this->db->table('auth_groups_users');
    $update = $builder->insert($dataGroups);
---
INSERT INTO `auth_groups_users` (`group_id`, `user_id`) VALUES ('2', 9)