app/Controllers/SetUp.php

    public function provide_hospitals()
    {
        // Get search keyword
        $keyword = $this->request->getVar('keyword');
        $data = [];

        // If no keyword found
        if (!$keyword) {
            $hospital = $this->hospitalModel->findAll(50);
---
SELECT *
FROM `hospitals`
WHERE `hospitals`.`deleted_at` IS NULL
 LIMIT 50