app/Views/admin-users.php

SELECT *
FROM `hospitals`
WHERE `id_hospital` = '3577015'
---

                  $builder = $db->table('hospitals');
                  $builder->where('id_hospital', $row['id_hospital']);
                  $hospital = $builder->get()->getRowArray();