app/Views/admin-index.php


                          <td>
                            <div>
                              <?php $hospital_req = $hospitalModel->where('id_hospital', $row['id_hospital_req'])->first() ?>
---
SELECT *
FROM `hospitals`
WHERE `id_hospital` = '3502010'
AND `hospitals`.`deleted_at` IS NULL
 LIMIT 1


                          <td>
                            <div class="text-start">
                              <?php $hospital_destination = $hospitalModel->where('id_hospital', $row['id_hospital_destination'])->first() ?>
---
SELECT *
FROM `hospitals`
WHERE `id_hospital` = '1674002'
AND `hospitals`.`deleted_at` IS NULL
 LIMIT 1